# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000
poprosit = 0
monats = 10
while monats > 0:
    if monats == 10:
        poprosit += expenses - educational_grant
    else:
        expenses += expenses * 0.03
        poprosit += expenses - educational_grant
    monats -= 1
print('Студенту нужно попросить %s рублей' % poprosit)